Repository: selfcan/StrokeMouse
Catalog: StrokeMouse/Resources/Localizable.xcstrings
Source language: en
Languages: fr, ja, ko, ru, zh_hans, zh_hant

# menu.pauseGestures
source: Pause Gestures
fr: Mettre les gestes en pause
ja: ジェスチャを一時停止
ko: 제스처 일시 정지
ru: Приостановить жесты
zh_hans: 暂停手势
zh_hant: 暫停手勢

# menu.resumeGestures
source: Resume Gestures
fr: Reprendre les gestes
ja: ジェスチャを再開
ko: 제스처 재개
ru: Возобновить жесты
zh_hans: 恢复手势
zh_hant: 恢復手勢

# menu.openSettings
source: Settings…
fr: Réglages…
ja: 設定…
ko: 설정…
ru: Настройки…
zh_hans: 设置…
zh_hant: 設定…

# menu.grantAccessibility
source: Grant Accessibility…
fr: Autoriser l’accessibilité…
ja: アクセシビリティを許可…
ko: 손쉬운 사용 허용…
ru: Предоставить Универсальный доступ…
zh_hans: 授权辅助功能…
zh_hant: 授權輔助使用…

# menu.about
source: About
fr: À propos
ja: StrokeMouseについて
ko: 정보
ru: О программе
zh_hans: 关于
zh_hant: 關於

# menu.github
source: Github（点个Star🌟）
fr: Github (ajoutez une étoile 🌟)
ja: Github（Starをお願い🌟）
ko: Github（Star🌟 눌러주세요）
ru: Github (поставьте Star🌟)

# menu.quit
source: Quit StrokeMouse
fr: Quitter StrokeMouse
ja: StrokeMouseを終了
ko: StrokeMouse 종료
ru: Завершить StrokeMouse
zh_hans: 退出 StrokeMouse
zh_hant: 退出 StrokeMouse

# tab.gestures
source: Gestures
fr: Gestes
ja: ジェスチャ
ko: 제스처
ru: Жесты
zh_hans: 手势
zh_hant: 手勢

# tab.general
source: General
fr: Général
ja: 一般
ko: 일반
ru: Основные
zh_hans: 通用
zh_hant: 通用

# tab.permissions
source: Permissions
fr: Autorisations
ja: 権限
ko: 권한
ru: Доступ
zh_hans: 权限
zh_hant: 許可權

# tab.about
source: About
fr: À propos
ja: 情報
ko: 정보
ru: О программе
zh_hans: 关于
zh_hant: 關於

# gestures.title
source: Gesture Profiles
fr: Profils de gestes
ja: ジェスチャプロファイル
ko: 제스처 구성
ru: Профили жестов
zh_hans: 手势配置
zh_hant: 手勢配置

# gestures.add
source: Add
fr: Ajouter
ja: 追加
ko: 추가
ru: Добавить
zh_hans: 添加
zh_hant: 新增

# gestures.import
source: Import
fr: Importer
ja: 読み込む
ko: 가져오기
ru: Импортировать
zh_hans: 导入
zh_hant: 匯入

# gestures.export
source: Export
fr: Exporter
ja: 書き出す
ko: 내보내기
ru: Экспортировать
zh_hans: 导出
zh_hant: 匯出

# gestures.importFailedTitle
source: Import Failed
fr: Échec de l’importation
ja: 読み込みに失敗しました
ko: 가져오기 실패
ru: Не удалось импортировать
zh_hans: 导入失败
zh_hant: 匯入失敗

# gestures.exportFailedTitle
source: Export Failed
fr: Échec de l’exportation
ja: 書き出しに失敗しました
ko: 내보내기 실패
ru: Не удалось экспортировать
zh_hans: 导出失败
zh_hant: 匯出失敗

# gestures.importEmpty
source: No gestures found in this file.
fr: Aucun geste n’a été trouvé dans ce fichier.
ja: このファイルにはジェスチャが見つかりません。
ko: 이 파일에서 제스처를 찾지 못했습니다.
ru: В этом файле не найдено жестов.
zh_hans: 文件中没有手势规则。
zh_hant: 檔案中沒有手勢規則。

# gestures.exportDefaultFilename
source: StrokeMouse-gestures
fr: StrokeMouse-gestes
ja: StrokeMouse-ジェスチャ
ko: StrokeMouse-제스처
ru: StrokeMouse-жесты

# gestures.edit
source: Edit
fr: Modifier
ja: 編集
ko: 편집
ru: Изменить
zh_hans: 编辑
zh_hant: 編輯

# gestures.delete
source: Delete
fr: Supprimer
ja: 削除
ko: 삭제
ru: Удалить
zh_hans: 删除
zh_hant: 刪除

# gestures.deleteConfirmTitle
source: Delete Gestures?
fr: Supprimer les gestes ?
ja: ジェスチャを削除しますか？
ko: 제스처를 삭제할까요?
ru: Удалить жесты?
zh_hans: 删除手势？
zh_hant: 刪除手勢？

# gestures.deleteConfirmMessage
source: Are you sure you want to delete %d selected gesture(s)? This cannot be undone.
fr: Voulez-vous vraiment supprimer les %d geste(s) sélectionné(s) ? Cette action est irréversible.
ja: 選択した%d件のジェスチャを削除しますか？この操作は取り消せません。
ko: 선택한 제스처 %d개를 삭제할까요? 이 작업은 취소할 수 없습니다.
ru: Вы действительно хотите удалить выбранные жесты (%d)? Это действие нельзя отменить.
zh_hans: 确定要删除选中的 %d 条手势吗？此操作无法撤销。
zh_hant: 確定要刪除選中的 %d 條手勢嗎？此操作無法撤銷。

# gestures.importDuplicatesTitle
source: Duplicate Gestures Found
fr: Gestes en double détectés
ja: 重複するジェスチャが見つかりました
ko: 중복된 제스처를 찾았습니다
ru: Найдены повторяющиеся жесты
zh_hans: 发现重复手势
zh_hant: 發現重複手勢

# gestures.importDuplicatesMessage
source: %d of %d gestures already exist:
fr: %d geste(s) sur %d existent déjà :
ja: %d件のジェスチャが既に存在します（全%d件）:
ko: 제스처 %d개가 이미 존재합니다(전체 %d개):
ru: %d из %d жестов уже существуют:
zh_hans: 有 %d 条规则与现有配置重复（共 %d 条）：
zh_hant: 有 %d 條規則與現有配置重複（共 %d 條）：

# gestures.importDuplicatesFooter
source: Force import will add copies and leave them disabled. You can also skip the duplicates.
fr: L’importation forcée ajoute des copies et les laisse désactivées ; vous pouvez aussi ignorer les doublons.
ja: 強制的に読み込むとコピーを追加し、無効のまま残します。重複をスキップすることもできます。
ko: 강제 가져오기는 복사본을 추가하고 비활성 상태로 두며, 중복 항목을 건너뛸 수도 있습니다.
ru: Принудительный импорт добавит копии и оставит их отключёнными; также можно пропустить повторы.
zh_hans: 强制导入将添加副本，且默认不启用；也可选择跳过重复项。
zh_hant: 強制匯入將新增副本，且預設不啟用；也可選擇跳過重複項。

# gestures.importDuplicatesMore
source: • …and %d more
fr: • …et %d de plus
ja: • …ほか%d件
ko: • …그 외 %d개
ru: • …и ещё %d
zh_hans: • ……另有 %d 条
zh_hant: • ……另有 %d 條

# gestures.importForce
source: Force Import
fr: Importer de force
ja: 強制的に読み込む
ko: 강제 가져오기
ru: Импортировать принудительно
zh_hans: 强制导入
zh_hant: 強制匯入

# gestures.importSkipDuplicates
source: Skip Duplicates
fr: Ignorer les doublons
ja: 重複をスキップ
ko: 중복 건너뛰기
ru: Пропустить повторы
zh_hans: 跳过重复
zh_hant: 跳過重複

# gestures.importAllSkipped
source: All gestures in this file already exist. Nothing was imported.
fr: Tous les gestes de ce fichier existent déjà. Rien n’a été importé.
ja: このファイルのジェスチャはすべて既に存在するため、何も読み込みませんでした。
ko: 이 파일의 제스처가 모두 이미 있어 가져온 항목이 없습니다.
ru: Все жесты из этого файла уже существуют. Ничего не импортировано.
zh_hans: 文件中的手势均已存在，未导入任何规则。
zh_hant: 檔案中的手勢均已存在，未匯入任何規則。

# gestures.duplicate
source: Duplicate
fr: Dupliquer
ja: 複製
ko: 복제
ru: Дублировать
zh_hans: 复制
zh_hant: 複製

# gestures.copySuffix
source: Copy
fr: copie
ja: のコピー
ko: 복사본
ru: копия
zh_hans: 副本
zh_hant: 副本

# gestures.newName
source: New Gesture
fr: Nouveau geste
ja: 新規ジェスチャ
ko: 새 제스처
ru: Новый жест
zh_hans: 新手势
zh_hant: 新手勢

# gestures.emptyTitle
source: No Gestures Yet
fr: Aucun geste pour le moment
ja: ジェスチャはまだありません
ko: 아직 제스처가 없습니다
ru: Жестов пока нет
zh_hans: 还没有手势
zh_hant: 還沒有手勢

# gestures.emptySubtitle
source: Add a gesture profile to start customizing your mouse.
fr: Ajoutez un profil de geste pour commencer à personnaliser votre souris.
ja: ジェスチャプロファイルを追加して、マウスのカスタマイズを始めましょう。
ko: 제스처 구성을 추가하여 마우스를 사용자화하세요.
ru: Добавьте профиль жеста, чтобы начать настраивать мышь.
zh_hans: 添加手势配置，开始自定义鼠标操作。
zh_hant: 新增手勢配置，開始自定義滑鼠操作。

# gestures.resetDefaults
source: Reset to Defaults
fr: Réinitialiser
ja: デフォルトに戻す
ko: 기본값으로 재설정
ru: Сбросить к стандартным
zh_hans: 恢复默认
zh_hant: 恢復預設

# gestures.test
source: Gesture Test
fr: Test des gestes
ja: ジェスチャテスト
ko: 제스처 테스트
ru: Проверка жестов
zh_hans: 手势测试
zh_hant: 手勢測試

# gestureTest.title
source: Gesture Test
fr: Test des gestes
ja: ジェスチャテスト
ko: 제스처 테스트
ru: Проверка жестов
zh_hans: 手势测试
zh_hant: 手勢測試

# gestureTest.subtitle
source: Choose an input mode to inspect production recognition. Diagnostics never runs actions or applies app scope.
fr: Choisissez un mode d’entrée pour examiner la reconnaissance réelle ; le diagnostic n’exécute jamais d’actions et n’applique pas la portée des apps.
ja: 入力方式を選んで本番の認識結果を確認します。診断ではアクションは実行されず、アプリ範囲も適用されません。
ko: 입력 방식을 선택해 실제 인식 결과를 확인하며, 진단 모드에서는 동작을 실행하지 않고 앱 범위도 적용하지 않습니다.
ru: Выберите режим ввода, чтобы проверить рабочее распознавание; диагностика не выполняет действия и не применяет область приложений.
zh_hans: 选择输入方式查看正式识别结果，诊断模式不会执行动作，也不受应用范围限制。
zh_hant: 選擇輸入方式檢視正式識別結果，診斷模式不會執行動作，也不受應用範圍限制。

# gestureTest.globalPaused
source: Global Recognition Paused
fr: Reconnaissance globale en pause
ja: 全体の認識は一時停止中
ko: 전역 인식이 일시 정지됨
ru: Глобальное распознавание приостановлено
zh_hans: 全局识别已暂停
zh_hant: 全域性識別已暫停

# gestureTest.trigger
source: Trigger
fr: Déclencheur
ja: トリガー
ko: 트리거
ru: Триггер
zh_hans: 触发键
zh_hant: 觸發鍵

# gestureTest.canvas
source: Draw a Test Stroke
fr: Dessinez un tracé de test
ja: テストストロークを描く
ko: 테스트 스트로크 그리기
ru: Нарисуйте тестовую траекторию
zh_hans: 绘制测试轨迹
zh_hant: 繪製測試軌跡

# gestureTest.results
source: Match Results
fr: Résultats de correspondance
ja: 照合結果
ko: 일치 결과
ru: Результаты совпадения
zh_hans: 匹配结果
zh_hant: 匹配結果

# gestureTest.emptyResult
source: Draw to See Results
fr: Dessinez pour voir les résultats
ja: 描画すると結果が表示されます
ko: 그린 뒤 결과를 확인하세요
ru: Нарисуйте, чтобы увидеть результаты
zh_hans: 绘制后查看结果
zh_hant: 繪製後檢視結果

# gestureTest.noCandidates
source: No enabled gesture candidates were found for this input.
fr: Aucun geste candidat activé n’a été trouvé pour cette entrée.
ja: この入力に使える有効なジェスチャ候補が見つかりません。
ko: 이 입력에 대해 활성화된 제스처 후보를 찾지 못했습니다.
ru: Для этого ввода не найдено включённых кандидатов жестов.
zh_hans: 没有找到适用于此输入的启用手势候选。
zh_hant: 沒有找到適用於此輸入的啟用手勢候選。

# gestureTest.decision.accepted
source: Accepted
fr: Accepté
ja: 認識成功
ko: 인식됨
ru: Принято
zh_hans: 识别通过
zh_hant: 識別透過

# gestureTest.decision.invalidPath
source: Invalid Path
fr: Tracé non valide
ja: 無効な軌跡
ko: 잘못된 경로
ru: Недопустимая траектория
zh_hans: 轨迹无效
zh_hant: 軌跡無效

# gestureTest.decision.tooShort
source: Stroke Too Short
fr: Tracé trop court
ja: ストロークが短すぎます
ko: 스트로크가 너무 짧음
ru: Слишком короткая траектория
zh_hans: 轨迹太短
zh_hant: 軌跡太短

# gestureTest.decision.noCandidates
source: No Candidates
fr: Aucun candidat
ja: 候補なし
ko: 후보 없음
ru: Нет кандидатов
zh_hans: 没有候选手势
zh_hant: 沒有候選手勢

# gestureTest.decision.belowThreshold
source: Below Acceptance Threshold
fr: Sous le seuil d’acceptation
ja: しきい値未満
ko: 허용 임계값 미만
ru: Ниже порога принятия
zh_hans: 低于正式阈值
zh_hant: 低於正式閾值

# gestureTest.decision.ambiguous
source: Ambiguous Candidates
fr: Candidats ambigus
ja: 候補が近すぎます
ko: 후보가 모호함
ru: Неоднозначные кандидаты
zh_hans: 候选结果过于接近
zh_hant: 候選結果過於接近

# gestureTest.pathMetrics
source: Length %d pt · %d raw points
fr: Longueur %d pt · %d points bruts
ja: 長さ %d pt · 元の点数 %d
ko: 길이 %d pt · 원본 점 %d개
ru: Длина %d pt · %d исходных точек
zh_hans: 长度 %d pt · 原始点数 %d
zh_hant: 長度 %d pt · 原始點數 %d

# gestureTest.policyMetrics
source: Threshold %d%% · Required lead %d%%
fr: Seuil %d%% · avance requise %d%%
ja: しきい値 %d%% · 必要なリード %d%%
ko: 임계값 %d%% · 필요 선두 %d%%
ru: Порог %d%% · требуемое преимущество %d%%
zh_hans: 阈值 %d%% · 要求领先 %d%%
zh_hant: 閾值 %d%% · 要求領先 %d%%

# gestureTest.matchScore
source: Final
fr: Score final
ja: 最終スコア
ko: 최종
ru: Итог
zh_hans: 最终分
zh_hant: 最終分

# gestureTest.shapeScore
source: Geometry
fr: Géométrie
ja: 幾何スコア
ko: 기하
ru: Геометрия
zh_hans: 几何分
zh_hant: 幾何分

# gestureTest.matchMode.singleTurnCanonical
source: Flexible single-turn matching
fr: Correspondance souple à un virage
ja: 柔軟な単一ターン照合
ko: 유연한 단일 회전 일치
ru: Гибкое сопоставление с одним поворотом
zh_hans: 弹性单转弯匹配
zh_hant: 彈性單轉彎匹配

# gestureTest.matchMode.simpleSegmentCanonical
source: Segment-aligned matching
fr: Correspondance alignée sur les segments
ja: セグメント整列照合
ko: 구간 정렬 일치
ru: Сопоставление по сегментам
zh_hans: 分段对齐匹配
zh_hant: 分段對齊匹配

# gestureTest.matchMode.orderedPath
source: Ordered-path matching
fr: Correspondance du tracé ordonné
ja: 順序付きパス照合
ko: 순서 경로 일치
ru: Сопоставление упорядоченной траектории
zh_hans: 有序全路径匹配
zh_hant: 有序全路徑匹配

# gestureTest.structurePassed
source: Structure Passed
fr: Structure validée
ja: 構造チェック通過
ko: 구조 검사 통과
ru: Структура пройдена
zh_hans: 结构门控通过
zh_hant: 結構門控透過

# gestureTest.structure.invalidStroke
source: Invalid test stroke
fr: Tracé de test non valide
ja: テストストロークが無効です
ko: 테스트 스트로크가 올바르지 않음
ru: Недопустимая тестовая траектория
zh_hans: 测试轨迹无效
zh_hant: 測試軌跡無效

# gestureTest.structure.invalidTemplate
source: Invalid saved template
fr: Modèle enregistré non valide
ja: 保存済みテンプレートが無効です
ko: 저장된 템플릿이 올바르지 않음
ru: Недопустимый сохранённый шаблон
zh_hans: 已保存模板无效
zh_hant: 已儲存模板無效

# gestureTest.structure.segmentCount
source: Significant segment count differs
fr: Le nombre de segments significatifs diffère
ja: 有意セグメント数が異なります
ko: 유의미한 구간 수가 다름
ru: Число значимых сегментов отличается
zh_hans: 显著分段数量不同
zh_hant: 顯著分段數量不同

# gestureTest.structure.segmentProportion
source: Segment proportions differ too much
fr: Les proportions des segments diffèrent trop
ja: セグメントの長さ比率の差が大きすぎます
ko: 구간 길이 비율 차이가 너무 큼
ru: Пропорции сегментов слишком различаются
zh_hans: 分段长度比例差异过大
zh_hant: 分段長度比例差異過大

# gestureTest.structure.terminalOverrun
source: Extra terminal stroke is too long
fr: Le trait terminal supplémentaire est trop long
ja: 末尾の余分なストロークが長すぎます
ko: 끝부분의 추가 스트로크가 너무 김
ru: Лишний конечный штрих слишком длинный
zh_hans: 末端多画轨迹过长
zh_hant: 末端多畫軌跡過長

# gestureTest.structure.lineDirection
source: Line direction differs
fr: La direction de la ligne diffère
ja: 直線の方向が異なります
ko: 직선 방향이 다름
ru: Направление линии отличается
zh_hans: 直线方向不同
zh_hant: 直線方向不同

# gestureTest.structure.startDirection
source: Starting direction differs
fr: La direction de départ diffère
ja: 開始方向が異なります
ko: 시작 방향이 다름
ru: Начальное направление отличается
zh_hans: 起始方向不同
zh_hant: 起始方向不同

# gestureTest.structure.turnDirection
source: Turn direction differs
fr: Le sens du virage diffère
ja: ターンの向きが異なります
ko: 회전 방향이 다름
ru: Направление поворота отличается
zh_hans: 转向符号不同
zh_hant: 轉向符號不同

# gestureTest.structure.turnAngle
source: Turn angle differs
fr: L’angle du virage diffère
ja: ターン角度が異なります
ko: 회전 각도가 다름
ru: Угол поворота отличается
zh_hans: 转角差异过大
zh_hant: 轉角差異過大

# gestureTest.structure.endpointDirection
source: Endpoint tangent differs
fr: La tangente à l’extrémité diffère
ja: 終点の接線方向が異なります
ko: 끝점 접선 방향이 다름
ru: Касательная в конечной точке отличается
zh_hans: 端点切线方向不同
zh_hant: 端點切線方向不同

# gestureTest.logPending
source: Each completed stroke will be appended to the diagnostic log.
fr: Chaque tracé terminé sera ajouté au journal de diagnostic.
ja: ストロークを完了するたびに、診断ログへ追記されます。
ko: 스트로크를 완료할 때마다 진단 로그에 추가됩니다.
ru: Каждая завершённая траектория будет добавлена в диагностический журнал.
zh_hans: 每次完成绘制后都会追加到诊断日志。
zh_hant: 每次完成繪製後都會追加到診斷日誌。

# gestureTest.logSaved
source: Stroke, scores, and rejection reasons saved.
fr: Tracé, scores et motifs de rejet enregistrés.
ja: 軌跡、スコア、拒否理由を保存しました。
ko: 스트로크, 점수, 거부 사유가 저장되었습니다.
ru: Траектория, оценки и причины отклонения сохранены.
zh_hans: 轨迹、分数和拒绝原因已保存。
zh_hant: 軌跡、分數和拒絕原因已儲存。

# gestureTest.revealLog
source: Reveal Log
fr: Afficher le journal
ja: ログを表示
ko: 로그 보기
ru: Показать журнал
zh_hans: 显示日志
zh_hant: 顯示日誌

# gestureTest.close
source: Close
fr: Fermer
ja: 閉じる
ko: 닫기
ru: Закрыть
zh_hans: 关闭
zh_hant: 關閉

# gestureTest.logError
source: Failed to save diagnostic log
fr: Échec de l’enregistrement du journal de diagnostic
ja: 診断ログを保存できませんでした
ko: 진단 로그를 저장하지 못했습니다
ru: Не удалось сохранить диагностический журнал
zh_hans: 诊断日志保存失败
zh_hant: 診斷日誌儲存失敗

# general.engine
source: Gesture Engine
fr: Moteur de gestes
ja: ジェスチャエンジン
ko: 제스처 엔진
ru: Движок жестов
zh_hans: 手势引擎
zh_hant: 手勢引擎

# general.enableGestures
source: Enable Mouse Gestures
fr: Activer les gestes de la souris
ja: マウスジェスチャを有効にする
ko: 마우스 제스처 활성화
ru: Включить жесты мыши
zh_hans: 启用鼠标手势
zh_hant: 啟用滑鼠手勢

# general.triggerButton
source: Trigger Button
fr: Bouton de déclenchement
ja: トリガーボタン
ko: 트리거 버튼
ru: Кнопка триггера
zh_hans: 触发按键
zh_hant: 觸發按鍵

# general.minDistance
source: Minimum Stroke Distance
fr: Distance minimale de tracé
ja: 最小ストローク距離
ko: 최소 스트로크 거리
ru: Минимальная длина траектории
zh_hans: 最小滑动距离
zh_hant: 最小滑動距離

# general.matchThreshold
source: Match Threshold
fr: Seuil de correspondance
ja: 一致しきい値
ko: 일치 임계값
ru: Порог совпадения
zh_hans: 匹配阈值
zh_hant: 匹配閾值

# general.matchThresholdHint
source: Lower values are more sensitive and may conflict with similar gestures. Structural safety checks always remain enabled.
fr: Une valeur plus basse est plus sensible et peut entrer en conflit avec des gestes similaires ; les contrôles structurels de sécurité restent toujours actifs.
ja: 値を下げると反応しやすくなりますが、似たジェスチャと衝突しやすくなります。構造上の安全チェックは常に有効です。
ko: 값이 낮을수록 더 민감하며 비슷한 제스처와 충돌할 수 있고, 구조 안전 검사는 항상 켜져 있습니다.
ru: Меньшие значения повышают чувствительность и могут конфликтовать с похожими жестами; структурные проверки безопасности всегда остаются включёнными.
zh_hans: 数值越低越容易触发，也越可能与相似手势冲突；结构安全检查始终启用。
zh_hant: 數值越低越容易觸發，也越可能與相似手勢衝突；結構安全檢查始終啟用。

# general.showHUD
source: Show Drawing Feedback
fr: Afficher le retour visuel du dessin
ja: 描画フィードバックを表示
ko: 그리기 피드백 보기
ru: Показывать отклик при рисовании
zh_hans: 显示绘制反馈
zh_hant: 顯示繪製反饋

# general.includeHUDInCaptures
source: Show Drawing Feedback in Screenshots and Recordings
fr: Inclure le retour visuel dans les captures et enregistrements
ja: スクリーンショットと収録に描画フィードバックを含める
ko: 스크린샷과 녹화에 그리기 피드백 표시
ru: Показывать отклик при рисовании на снимках и записях экрана
zh_hans: 在截图与录屏中显示绘制反馈
zh_hant: 在截圖與錄屏中顯示繪製反饋

# general.includeHUDInCapturesHint
source: When enabled, screenshot and screen recording apps can capture the drawing trail. Whether a window-only capture includes it depends on the app.
fr: Une fois activé, les apps de capture et d’enregistrement d’écran peuvent inclure le tracé ; pour une capture limitée à une fenêtre, cela dépend de l’app.
ja: オンにすると、スクリーンショットや画面収録のアプリが描画軌跡をキャプチャできます。ウインドウのみのキャプチャに含まれるかはアプリによります。
ko: 켜면 스크린샷 및 화면 녹화 앱이 그리기 궤적을 캡처할 수 있으며, 단일 윈도우만 캡처할 때 포함 여부는 해당 앱에 따라 다릅니다.
ru: Если включено, приложения для снимков и записи экрана могут захватывать след рисования; при захвате только одного окна это зависит от приложения.
zh_hans: 开启后，截图和录屏软件可捕获绘制轨迹；仅捕获单个窗口时是否包含轨迹取决于软件。
zh_hant: 開啟後，截圖和錄屏軟體可捕獲繪製軌跡；僅捕獲單個視窗時是否包含軌跡取決於軟體。

# general.startup
source: Startup
fr: Ouverture
ja: 起動
ko: 시작
ru: Запуск
zh_hans: 启动
zh_hant: 啟動

# general.launchAtLogin
source: Launch at Login
fr: Ouvrir à la connexion
ja: ログイン時に開く
ko: 로그인 시 열기
ru: Открывать при входе
zh_hans: 登录时启动
zh_hant: 登入時啟動

# general.hideDockIcon
source: Hide Dock Icon
fr: Masquer l’icône du Dock
ja: Dockアイコンを非表示
ko: Dock 아이콘 가리기
ru: Скрыть значок в Dock
zh_hans: 隐藏 Dock 图标
zh_hant: 隱藏 Dock 圖示

# general.appearance
source: Appearance & Language
fr: Apparence et langue
ja: 外観と言語
ko: 모양새 및 언어
ru: Оформление и язык
zh_hans: 外观与语言
zh_hant: 外觀與語言

# general.appearanceMode
source: Appearance
fr: Apparence
ja: 外観
ko: 모양새
ru: Оформление
zh_hans: 外观
zh_hant: 外觀

# general.language
source: Language
fr: Langue
ja: 言語
ko: 언어
ru: Язык
zh_hans: 语言
zh_hant: 語言

# general.menuBarIconStyle
source: Menu Bar Icon
fr: Icône de la barre des menus
ja: メニューバーアイコン
ko: 메뉴 막대 아이콘
ru: Значок в строке меню
zh_hans: 菜单栏图标
zh_hant: 選單欄圖示

# general.languageHint
source: Takes effect immediately. The settings window stays open and refreshes to the selected language.
fr: Prend effet immédiatement ; la fenêtre des réglages reste ouverte et se rafraîchit dans la langue choisie.
ja: すぐに反映されます。設定ウインドウは開いたまま、選択した言語に更新されます。
ko: 즉시 적용되며, 설정 창은 열린 채로 선택한 언어로 새로 고쳐집니다.
ru: Вступает в силу сразу; окно настроек остаётся открытым и обновляется на выбранный язык.
zh_hans: 立即生效，设置窗口会保持打开，并刷新为所选语言。
zh_hant: 立即生效，設定視窗會保持開啟，並重新整理為所選語言。

# general.config
source: Configuration File
fr: Fichier de configuration
ja: 設定ファイル
ko: 구성 파일
ru: Файл конфигурации
zh_hans: 配置文件
zh_hant: 配置檔案

# general.configPath
source: Path
fr: Chemin
ja: 場所
ko: 경로
ru: Путь
zh_hans: 路径
zh_hant: 路徑

# general.revealConfig
source: Reveal in Finder
fr: Afficher dans le Finder
ja: Finderに表示
ko: Finder에서 보기
ru: Показать в Finder
zh_hans: 在 Finder 中显示
zh_hant: 在 Finder 中顯示

# trigger.middle
source: Middle Button
fr: Bouton du milieu
ja: 中ボタン
ko: 가운데 버튼
ru: Средняя кнопка
zh_hans: 中键
zh_hant: 中鍵

# trigger.sideBack
source: Side Button (Back)
fr: Bouton latéral (précédent)
ja: サイドボタン（戻る）
ko: 측면 버튼 (뒤로)
ru: Боковая кнопка (назад)
zh_hans: 侧键（后退）
zh_hant: 側鍵（後退）

# trigger.sideForward
source: Side Button (Forward)
fr: Bouton latéral (suivant)
ja: サイドボタン（進む）
ko: 측면 버튼 (앞으로)
ru: Боковая кнопка (вперёд)
zh_hans: 侧键（前进）
zh_hant: 側鍵（前進）

# trigger.right
source: Right Button
fr: Bouton droit
ja: 右ボタン
ko: 오른쪽 버튼
ru: Правая кнопка
zh_hans: 右键
zh_hant: 右鍵

# appearance.system
source: System
fr: Système
ja: システム
ko: 자동
ru: Как в системе
zh_hans: 跟随系统
zh_hant: 跟隨系統

# appearance.light
source: Light
fr: Clair
ja: ライト
ko: 라이트
ru: Светлая
zh_hans: 浅色
zh_hant: 淺色

# appearance.dark
source: Dark
fr: Sombre
ja: ダーク
ko: 다크
ru: Тёмная
zh_hans: 深色
zh_hant: 深色

# language.system
source: System
fr: Système
ja: システム設定に合わせる
ko: 시스템
ru: Как в системе
zh_hans: 跟随系统
zh_hant: 跟隨系統

# menuBarIcon.color
source: Color
fr: Couleur
ja: カラー
ko: 컬러
ru: Цветная
zh_hans: 彩色
zh_hant: 彩色

# menuBarIcon.monochrome
source: Monochrome (Adapts Automatically)
fr: Monochrome (adaptation automatique)
ja: モノクロ（自動で適応）
ko: 단색 (자동 적응)
ru: Монохромная (подстраивается автоматически)
zh_hans: 黑白（自动适配）
zh_hant: 黑白（自動適配）

# permissions.required
source: Required
fr: Obligatoire
ja: 必須
ko: 필수
ru: Обязательно
zh_hans: 必需
zh_hant: 必需

# permissions.optional
source: Optional
fr: Facultatif
ja: 任意
ko: 선택 사항
ru: Необязательно
zh_hans: 可选
zh_hant: 可選

# permissions.accessibilityTitle
source: Accessibility
fr: Accessibilité
ja: アクセシビリティ
ko: 손쉬운 사용
ru: Универсальный доступ
zh_hans: 辅助功能
zh_hant: 輔助使用

# permissions.accessibilityGranted
source: Granted — gesture listening can run.
fr: Autorisé — l’écoute des gestes peut fonctionner.
ja: 許可済み — ジェスチャの監視を実行できます。
ko: 허용됨 — 제스처 수신을 실행할 수 있습니다.
ru: Разрешено — прослушивание жестов может работать.
zh_hans: 已授权 — 手势监听可以运行。
zh_hant: 已授權 — 手勢監聽可以執行。

# permissions.accessibilityDenied
source: Not granted — global mouse gestures will not work.
fr: Non autorisé — les gestes de souris globaux ne fonctionneront pas.
ja: 未許可 — グローバルなマウスジェスチャは動作しません。
ko: 허용되지 않음 — 전역 마우스 제스처가 작동하지 않습니다.
ru: Не разрешено — глобальные жесты мыши не будут работать.
zh_hans: 未授权 — 全局鼠标手势无法工作。
zh_hant: 未授權 — 全域性滑鼠手勢無法工作。

# permissions.accessibilityFooter
source: Required to observe mouse buttons and inject keyboard / window actions. If the system toggle is on but this page still shows denied, remove StrokeMouse from Privacy → Accessibility, quit the app, reopen it, then enable it again (common after re-signing).
fr: Nécessaire pour observer les boutons de la souris et injecter des actions clavier ou de fenêtre. Si l’option système est activée mais que cette page indique encore un refus, retirez StrokeMouse de Confidentialité et sécurité → Accessibilité, quittez l’app, rouvrez-la, puis réactivez l’option (fréquent après une nouvelle signature).
ja: マウスボタンの監視と、キーボード／ウインドウ操作の注入に必要です。システムのスイッチはオンなのにこのページが未許可のままなら、「プライバシーとセキュリティ → アクセシビリティ」からStrokeMouseを取り除き、アプリを終了して開き直し、もう一度オンにしてください（署名のやり直し後によくあります）。
ko: 마우스 버튼 관찰과 키보드 / 윈도우 동작 주입에 필요하며, 시스템 스위치가 켜져 있는데도 이 페이지가 거부됨으로 표시되면 개인 정보 보호 → 손쉬운 사용에서 StrokeMouse를 제거한 뒤 앱을 종료하고 다시 연 다음 다시 켜세요(서명 변경 후 흔함).
ru: Необходимо для отслеживания кнопок мыши и внедрения действий клавиатуры и окон. Если системный переключатель включён, но на этой странице по-прежнему указано «не разрешено», удалите StrokeMouse из «Конфиденциальность и безопасность → Универсальный доступ», полностью завершите приложение, откройте его снова и включите доступ ещё раз (часто требуется после повторной подписи).
zh_hans: 用于监听鼠标按键，以及注入快捷键 / 窗口操作；若系统开关已打开但此处仍显示未授权，请在「隐私与安全性 → 辅助功能」中移除 StrokeMouse，完全退出应用后重新打开，再重新打开开关（更换签名证书后常见）。
zh_hant: 用於監聽滑鼠按鍵，以及注入快捷鍵 / 視窗操作；若系統開關已開啟但此處仍顯示未授權，請在「隱私與安全性 → 輔助使用」中移除 StrokeMouse，完全退出應用後重新開啟，再重新開啟開關（更換簽名證書後常見）。

# permissions.grant
source: Request Access
fr: Demander l’accès
ja: アクセスを要求
ko: 접근 요청
ru: Запросить доступ
zh_hans: 请求授权
zh_hant: 請求授權

# permissions.openSettings
source: Open System Settings
fr: Ouvrir Réglages Système
ja: システム設定を開く
ko: 시스템 설정 열기
ru: Открыть «Системные настройки»
zh_hans: 打开系统设置
zh_hant: 開啟系統設定

# permissions.automationTitle
source: Automation
fr: Automatisation
ja: 自動化
ko: 자동화
ru: Автоматизация
zh_hans: 自动化
zh_hant: 自動化

# permissions.automationBody
source: Needed when AppleScript actions control other apps. macOS will prompt per-app.
fr: Requis lorsque des actions AppleScript contrôlent d’autres apps ; macOS demandera l’autorisation pour chaque app.
ja: AppleScriptアクションがほかのアプリを制御するときに必要です。macOSがアプリごとに確認します。
ko: AppleScript 동작이 다른 앱을 제어할 때 필요하며, macOS가 앱마다 요청합니다.
ru: Нужно, когда действия AppleScript управляют другими приложениями; macOS запросит разрешение для каждого приложения.
zh_hans: 当 AppleScript 动作控制其他 App 时需要，系统会按应用弹窗请求。
zh_hant: 當 AppleScript 動作控制其他 App 時需要，系統會按應用彈窗請求。
